<?php

use Illuminate\Support\Facades\DB;
use Illuminate\Database\Seeder;
use App\Virus;
use App\Locale;

class VirusSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('viruses')->truncate();
        DB::table('viruses_texts')->truncate();

        $viruses = [
            [
                'name' =>
                    ['ua' => 'Отто',
                    'ru' => 'Отто',
                    'en' => 'Отто'],
                'description' =>
                    ['ua' => 'Отто - справжній бешкетник, любить поморочити іншим голову. Букви інфікованого ним слова обертаються у довільному напрямку із довільною швидкістю',
                    'ru' => 'Отто - справжній бешкетник, любить поморочити іншим голову. Букви інфікованого ним слова обертаються у довільному напрямку із довільною швидкістю',
                    'en' => 'Отто - справжній бешкетник, любить поморочити іншим голову. Букви інфікованого ним слова обертаються у довільному напрямку із довільною швидкістю'],
                'type' => 1,
                'image' => 'virus1.png',
                'code' => 'ua',
            ],
            [
                'name' =>
                    ['ua' => 'Фредді',
                    'ru' => 'Фредді',
                    'en' => 'Фредді'],
                'description' =>
                    ['ua' => 'Фредді - скажений психопат. Він ні на хвильку не дасть Вам розслабитися. Інфіковане ним слово тремтить по горизонталі, а його букви перевернуті на 180 градусів та відображені дзеркально',
                    'ru' => 'Фредді - скажений психопат. Він ні на хвильку не дасть Вам розслабитися. Інфіковане ним слово тремтить по горизонталі, а його букви перевернуті на 180 градусів та відображені дзеркально',
                    'en' => 'Фредді - скажений психопат. Він ні на хвильку не дасть Вам розслабитися. Інфіковане ним слово тремтить по горизонталі, а його букви перевернуті на 180 градусів та відображені дзеркально'],
                'type' => 2,
                'image' => 'virus2.png',
                'code' => 'ua',
            ],
            [
                'name' =>
                    ['ua' => 'Томас',
                    'ru' => 'Томас',
                    'en' => 'Томас'],
                'description' =>
                    ['ua' => 'Томас затьмарює розсуд та викликає дезорієнтацію. Букви інфікованого ним слова змінють свій порядок. Цифри під літерами вказують на правильну позицію букви у слові',
                    'ru' => 'Томас затьмарює розсуд та викликає дезорієнтацію. Букви інфікованого ним слова змінють свій порядок. Цифри під літерами вказують на правильну позицію букви у слові',
                    'en' => 'Томас затьмарює розсуд та викликає дезорієнтацію. Букви інфікованого ним слова змінють свій порядок. Цифри під літерами вказують на правильну позицію букви у слові'],
                'type' => 3,
                'image' => 'virus3.png',
                'code' => 'ua',
            ],
            [
                'name' =>
                    ['ua' => 'Луі',
                    'ru' => 'Луі',
                    'en' => 'Луі'],
                'description' =>
                    ['ua' => 'Луі хоч і має три ока, але бачить лише одним, при чому, щоразу іншим. Букви інфікованого ним слова по черзі зникають та з\'являються',
                    'ru' => 'Луі хоч і має три ока, але бачить лише одним, при чому, щоразу іншим. Букви інфікованого ним слова по черзі зникають та з\'являються',
                    'en' => 'Луі хоч і має три ока, але бачить лише одним, при чому, щоразу іншим. Букви інфікованого ним слова по черзі зникають та з\'являються'],
                'type' => 4,
                'image' => 'virus4.png',
                'code' => 'ua',
            ],
            [
                'name' =>
                    ['ua' => 'Едуард',
                    'ru' => 'Едуард',
                    'en' => 'Едуард'],
                'description' =>
                    ['ua' => 'Едуард пишається тим, може пролізти у будь яку щілину, тому і вимагає цього ж від інших. Інфіковане ним слово проектується через невеликий проміжок, який рухаться зверху вниз',
                    'ru' => 'Едуард пишається тим, може пролізти у будь яку щілину, тому і вимагає цього ж від інших. Інфіковане ним слово проектується через невеликий проміжок, який рухаться зверху вниз',
                    'en' => 'Едуард пишається тим, може пролізти у будь яку щілину, тому і вимагає цього ж від інших. Інфіковане ним слово проектується через невеликий проміжок, який рухаться зверху вниз'],
                'type' => 5,
                'image' => 'virus5.png',
                'code' => 'ua',
            ],
            [
                'name' =>
                    ['ua' => 'Кетлін',
                    'ru' => 'Кетлін',
                    'en' => 'Кетлін'],
                'description' =>
                    ['ua' => 'Кетлін любить бавитися із зоровими центрами жертви. Інфіковане нею слово відображаться розмитим, яке поступово фокусується до допустимого рівня, піля чого фокус знову втрачається',
                    'ru' => 'Кетлін любить бавитися із зоровими центрами жертви. Інфіковане нею слово відображаться розмитим, яке поступово фокусується до допустимого рівня, піля чого фокус знову втрачається',
                    'en' => 'Кетлін любить бавитися із зоровими центрами жертви. Інфіковане нею слово відображаться розмитим, яке поступово фокусується до допустимого рівня, піля чого фокус знову втрачається'],
                'type' => 6,
                'image' => 'virus6.png',
                'code' => 'ua',
            ],
        ];

        foreach ($viruses as $v) {
            $virus = new Virus;
            $virus->type = $v['type'];
            $virus->image = $v['image'];
            $virus->save();

            foreach ($v['name'] as $code => $text) {
                $locale = Locale::where('default', $code)->first();
                $virus->texts()->attach($locale->id, ['name' => $text, 'description' => $v['description'][$code]]);
            }
        }
    }
}
